api/app/controllers/api/v1/user_controller.rb

  def get_token
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "dupont@guide.com"]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "authentication_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    begin
      user = User.find(params[:id])

      if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "pinf@guide.com"], ["updated_at", "2015-09-27 13:01:12.964422"], ["id", 1]]

  def show
    begin
      user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]